name: "IP_NET"
layer {
  name: "input_data"
  type: "MemoryData"
  top: "data"
  top: "silence1"
  memory_data_param {
    batch_size: 256
    channels: 1
    height: 1
    width: 1
  }
}

layer {
  name: "input_label"
  type: "MemoryData"
  top: "label"
  top: "silence2"
  memory_data_param {
    batch_size: 256
    channels: 1
    height: 1
    width: 1
  }
}

layer {
    name: "silence_layer1"
    type: "Silence"
    bottom: "silence1"
}

layer{
    name: "silence_layer2"
    type: "Silence"
    bottom: "silence2"
}


layer {
  name: "ip1_layer"
  type: "InnerProduct"
  bottom: "data"
  top: "hidden_w"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}


layer {
  name: "ip2_layer"
  type: "InnerProduct"
  bottom: "hidden_w"
  top: "next_value"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "next_value"
  bottom: "label"
  top: "loss"
}
