name: "CNN_NET"
layer {
  name: "input_data"
  type: "MemoryData"
  top: "data"
  top: "silence1"
  memory_data_param {
    batch_size: 16
    channels: 1
    height: 512
    width: 512
  }
}

layer {
  name: "input_label"
  type: "MemoryData"
  top: "label"
  top: "silence2"
  memory_data_param {
    batch_size: 16
    channels: 1
    height: 1
    width: 10
  }
}

layer {
    name: "silence1"
    type: "Silence"
    bottom: "silence1"
}

layer{
    name: "silence2"
    type: "Silence"
    bottom: "silence2"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "data"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 32
    stride: 2
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 20
    kernel_size: 32
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "conv1"
  top: "result"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "result"
  bottom: "label"
  top: "loss"
}
