name: "IP_NET"
layer {
  name: "input_layer"
  type: "MemoryData"
  top: "data"
  top: "label"
  memory_data_param {
    batch_size: 256
    channels: 1
    height: 1024
    width: 1024
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 200
    kernel_size: 64
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "conv1"
  top: "result"
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "result"
  bottom: "label"
  top: "loss"
}
